[
  {
    "id": 1,
    "title": "Types of Video Content",
    "slug": "types-of-video-content",
    "date": "March 14, 2025",
    "content": "<p>At CNJN, you can create many different types of content. We offer a triple cam set with professional lighting and audio. This equipment lets you produce high-quality videos for a variety of needs. <br><br> Our setup is perfect for nonprofits, small businesses, and any organization looking to share their message. You can film interviews, events, promotional videos, and more. With CNJN's tools, your ideas come to life in a professional and engaging way.</p><br><u><h3>Some Ideas for Media Content</h3></u><h4>Testimonial Videos</h4> Showcase personal experiences and success stories.<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Ikw35h9GEps\" frameborder=\"0\" allowfullscreen></iframe><br><h3>Interviews</h3> Feature one-on-one or group discussions with key individuals.<br><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OtIoaI2CFh4\" frameborder=\"0\" allowfullscreen></iframe><br><h3>Direct Message</h3>Greet your audience, and share key messages about your organization.<br><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/HyTYhzQWVVs\" frameborder=\"0\" allowfullscreen></iframe></p>",
    "image": "http://cnjn.org/wp-content/uploads/2025/03/creator_0000-1.jpg",
    "author": "CNJN Team"
  },
  {
    "id": 2,
    "title": "Your Key Team Members",
    "slug": "your-key-team-members",
    "date": "March 14, 2025",
    "content": "<p>Assembling your core team is essential for a successful production. Each member plays a vital role in bringing your content to life. From directing and filming to sound, lighting, and editing, every contribution ensures your final product is professional, engaging, and impactful. At CNJN, our experienced team is dedicated to supporting your vision every step of the way.</p><h3>Talent Role</h3> The “talent” takes the role of being on camera. Your host and any guests to be included on-screen are all considered the “talent”. These are the stars of the production; they should be confident, clear, and well-spoken. \n<h3>Videographer Role</h3> The videographer is responsible for operating and managing the technical equipment to capture the production. They work with cameras, lighting, and editing tools to produce the final piece of media, ensuring that all visual elements meet the required quality standards. \n<h3>Director Role</h3> The director serves as the essential bridge between the videographer and the talent. Using creative judgment and vision, the director guides the entire production process—from coordinating technical details with the videographer to shaping the content alongside the hosts—to create a cohesive and engaging final product. <br><br> <em>Note: Productions can still work well with one person as both the videographer and the director. If one person is functioning in both roles, they should be familiar with the responsibilities of both roles.</em> \n<h3>How Many People Do I Need?</h3> For a successful shoot, you need at least two people: one host and one videographer. For a larger production, the inclusion of a director can help guide camera cuts to be more intentional while also coordinating the talent.",
    "image": "http://cnjn.org/wp-content/uploads/2025/03/creator_0000-2.jpg",
    "author": "CNJN Team"
  },
  {
    "id": 3,
    "title": "Preplanning Your Shoot",
    "slug": "preplanning-your-shoot",
    "date": "March 14, 2025",
    "content": "<p>Once you know the shape your media will take, and who you will need for your shoot, the next step is to flush out your idea with preplanning.</p><h3>Outline Your Idea</h3>Define the Core: What’s the main message or take away you want your audience to get? Pick the Format: What type of content fits best—interview, tutorial, vlog, narrative,PSA, or something entirely original? <h3>Set the Length</h3> How long should the video be? <br> ex: shortform (5 minutes), medium (10 minutes), longform (30 minutes). <h3>Assign a Videographer to Operate the Board</h3> Decide who will manage the board and cameras & receive training. <h3>Think About On-Screen Talent</h3> Think about who will appear on screen. Contact guests or on-screen talent early to confirm they’re availability. <h3>Plan Your Content</h3> Jot down key points you’ll cover or draft a full script. Keep it natural—reading off paper, notecards, or a laptop is totally fine! <h3>Consider B roll</h3> Switching between three cameras can get boring after a while. Adding B-roll (extra clips from outside the studio) makes it more fun to watch. It keeps things interesting and shows more than just people talking. <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/vVdHxadCuNM\" frameborder=\"0\" allowfullscreen></iframe> <h3>Set a Schedule</h3>Lock in the Details, choose the date and time, and confirm availability with your team. Book the Space: Reserve the studio time in advance via our online scheduler.<h3>Prep your Team</h3> Share essential details such as parking instructions, load-in times, and studio rules—all available <a href=\"https://cnjn.org/studio-tos\" target=\"_blank\"><u>here</u></a>. Ensure everyone involved—talent, crew, and assistants—knows the plan, including when and where to arrive.",
    "image": "http://cnjn.org/wp-content/uploads/2025/03/creator_0000-3.jpg",
    "author": "CNJN Team"
  },
  {
    "id": 4,
    "title": "Production Day",
    "slug": "production-day",
    "date": "March 14, 2025",
    "content": "<p>Now that you're on set and everyone is loaded into the studio, the director and videographer will work together to coordinate the shoot. Here’s a quick cheat sheet for common questions Hosts and Guests often ask <br><br><em>Note: the videographer will need to answer these questions if the there is no director</em></p> <h3>Common Questions</h3> <ul><li><strong>Where are the bathrooms?</strong><br>Follow the posted signage.<br><br></li><li><strong>Where are the mugs?</strong><br>In the kitchen—you’ll see them while following the bathroom signs.<br><br></li><li><strong>When are we starting?</strong><br>The director will announce the start time. Setup is normally 15 - 30 minuets.<br><br></li><li><strong>How do I know when to start talking?</strong><br>You’ll be cued with the word 'Action.' and/or via the start light.<br><br></li><li><strong>What if I mess up?</strong><br>Just pause, take a breath, and indicate that you’re restarting. Begin again by restating your last point. The videographer should take note of what time in the recording this took place and pass on that information to your editor for them to correct in post production.<br><br></li><li><strong>Where can I put my bags?</strong><br>In the control room.<br><br></li><li><strong>Where do I sit?</strong><br>Seating is available in the control room. You’re also free to wait on set, but please refrain from eating or drinking (except water) and moving the set furniture.<br><br></li><li><strong>Which camera do I look at?</strong><br>If you need to look at a camera, refer to the confidence monitor (the on-set TV), which will indicate the active camera. Or consult your director for which camera they would like you to focus on.<br><br></li><li><strong>How do I know when to stop?</strong><br>The Director will signal when the program is complete. When the start light displays yellow that's your cue to wrap up.</li></ul><h3>Working with your Videographer</h3> The Director and Videographer will work together in the control room. The Director will call out when to preview (line up the shot) and when to switch to the program feed (send the live video to the recorder).<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/HXY2Mqkrrfk\" frameborder=\"0\" allowfullscreen></iframe><br>At times, the shoot may need to be paused if the videographer needs to make adjustments or correct an error. <br><br> Experienced videographers can work closely with the director to set up dynamic shots, ensuring smooth transitions and professional-quality visuals.",
    "image": "http://cnjn.org/wp-content/uploads/2025/03/creator_0000-4.jpg",
    "author": "CNJN Team"
  },
  {
    "id": 5,
    "title": "Post-Production",
    "slug": "post-production",
    "date": "March 14, 2025",
    "content": "<p>Post-production is key to enhancing your media. Here are some ways to boost your content after your shoot:</p><h3>B-Roll & Alternative Media</h3>Add extra footage to support your interview or testimonial. This additional content gives more context and keeps viewers engaged.<h3>Intro/Outro & Title</h3>Use opening and closing segments with titles for names. Cutting to other media can also add visual interest.<h3>Editing Support</h3>CNJN offers a complimentary editing service to qualifying nonprofits to help polish their media and make the final product stand out. For other entities, our editing services can be accessed by applying for a membership.<h3>Data Distribution</h3>Files from your set will be sent via Drop box 1-2 days after your shoot.",
    "image": "http://cnjn.org/wp-content/uploads/2025/03/creator_0000-5.jpg",
    "author": "CNJN Team"
  }
]


